FROM python:3.12
<<<<<<< dev

## יצירת תקייה יעודית שתכיל את הקונטיינר ##
WORKDIR /app

## העתקת קובץ הדרישות והתקנת הספריות ##
COPY requirements.txt .
RUN pip install -r requirements.txt

## העתקת תוכן האפליקציה ##
COPY app.py .

## הגדרת הפקודה שתריץ את הקונטיינר שהאפליקציה תעלה בשפת פייתון ##
CMD ["python", "app.py"]
=======
##יצירת תקייה יעודית שתכיל את הקונטיינר##
WORKDIR /app
##העתקת תוכן האפליקציה##
COPY app.py . 
##הגדרת הפקודה שתריץ את הקונטיינר שהאפלקציה תעלה בשפת פייתון##
CMD ["python", "app.py"]
>>>>>>> main
